In [1]:
import pandas as pd

In [2]:
df_1 = pd.read_csv('./data_2011_2016.csv')
df_2 = pd.read_csv('./data_2019_2021.csv')

In [3]:
df_1.head()

,location,ref,price,description,owner,year
0,Xghajra,REF 571082,"256,000/Lm109,901",TERRACED HOUSE minutes walk from the promenade...,Owner 79728192/21806554,2016
1,Swieqi,REF 571088,"365,000/Lm156,695","TERRACED HOUSE in great area, having hall lead...",Owner 79380053/21385502,2016
2,Qormi,REF 571239,"300,000/Lm128,790","Highly finished elevated TERRACED HOUSE, consi...",Owner 77187944/21437467,2016
3,Msida,REF 570664,"186,300/Lm79,979","Corner, well kept TERRACED HOUSE comprising an...",Owner 99450405/21246533,2016
4,San Gwann,REF 571734,"210,000/Lm90,153",Corner TERRACED HOUSE comprising entrance hall...,Owner 99427561/99883181,2016

In [4]:
df_2.head()

,location,id,price,description,year
0,HAMRUN,700439,€260000,Highly finished corner PENTHOUSE served with l...,2019
1,SWIEQI,2002590,€430000,New on the market designer finished and fully...,2019
2,VITTORIOSA,2002588,€595000,A superb sea front designer finished third fl...,2019
3,SLIEMA,2002547,€440000,Very large fully furnished APARTMENT (approx ...,2019
4,ST PAULS BAY,2002394,€480000,A luxurious seafront APARTMENT situated in a ...,2019

In [5]:
df_1.drop(['owner'], axis=1, inplace=True)

In [6]:
df_2.rename(columns={'id': 'ref'}, inplace=True)

In [7]:
df = pd.concat([df_1, df_2])

In [8]:
df.to_csv('data_combined.csv', index=None)